Autodesk.Revit.DB.BindingMap.Erase(Autodesk.Revit.DB.Definition)
This method is used to erase one item in the map.
Remarks: The method Erase inherited from base class is not permitted for this class.
A Autodesk::Revit::Exceptions::InvalidOperationException will be thrown. Use Remove() instead to remove the binding
from the Revit session and from the map.

Autodesk.Revit.DB.BindingMap.Clear
This method is used to remove all the items in the map.
Remarks: The method Clear inherited from base class is not permitted for this class.
A Autodesk::Revit::Exceptions::InvalidOperationException will be thrown.

Autodesk.Revit.DB.BindingMap.Item(Autodesk.Revit.DB.Definition)
The get_Item method will get the binding item related to the input key.
key:  A parameter definition which can be an existing definition or one from a shared parameters file.
The returned value of get_Item is an InstanceBinding or TypeBinding object
that contains the set of categories to which the parameter is bound.
The input item is an InstanceBinding or TypeBinding object which contains the set of categories
to which the parameter should be bound.
Remarks:  set_Item is not permitted for this class. A Autodesk::Revit::Exceptions::InvalidOperationException will be thrown.
Instead use Insert, Remove and ReInsert to modify the bindings in the document.

Autodesk.Revit.DB.BindingMap.Contains(Autodesk.Revit.DB.Definition)
The Contains method is used to check if the parameter binding exists for one definition.
key:  A parameter definition which can be an existing definition or one from a shared parameters file.

Autodesk.Revit.DB.BindingMap.Remove(Autodesk.Revit.DB.Definition)
The Remove method is used to remove a parameter binding.
key:  A parameter definition which can be an existing definition or one from a shared parameters file.

Autodesk.Revit.DB.BindingMap.ReInsert(Autodesk.Revit.DB.Definition,Autodesk.Revit.DB.Binding,Autodesk.Revit.DB.BuiltInParameterGroup)
Removes an existing parameter and creates a new binding for a given parameter in a specified group.
key:  A parameter definition which can be an existing definition or one from a shared parameters file.
item:  An InstanceBinding or TypeBinding object which contains the set of categories to which the parameter should be bound.
parameterGroup:  The GroupID of the parameter definition, or INVALID if the parameter is not to be associated with any predefined group.
Remarks:  Note the type of the binding object dictates whether the parameter is bound to all
instances or just types. A parameter definition cannot be bound to both instances and types.
If the parameter binding already exists, remove the binding, create a new parameter binding.
If the parameter binding related to the input key doesn't exist in the database,
ReInsert will fail and false will be returned. In this case, Insert should be called.

Autodesk.Revit.DB.BindingMap.ReInsert(Autodesk.Revit.DB.Definition,Autodesk.Revit.DB.Binding)
Removes an existing parameter and creates a new binding for a given parameter.
Removes an existing parameter and creates a new binding for a given parameter.
key: A parameter definition which can be an existing definition or one from a shared parameters file.
item: An InstanceBinding or TypeBinding object which contains the set of categories to which the parameter should be bound.
Remarks: Note the type of the binding object dictates whether the parameter is bound to all
instances or just types. A parameter definition cannot be bound to both instances and types.
If the parameter binding already exists, remove the binding, create a new parameter binding.

Autodesk.Revit.DB.BindingMap.Insert(Autodesk.Revit.DB.Definition,Autodesk.Revit.DB.Binding,Autodesk.Revit.DB.BuiltInParameterGroup)
Creates a new parameter binding between a parameter and a set of categories in a specified group.
key:  A parameter definition which can be an existing definition or one from a shared parameters file.
item:  An InstanceBinding or TypeBinding object which contains the set of categories to which the parameter should be bound.
parameterGroup:  The GroupID of the parameter definition, or INVALID if the parameter is not to be associated with any predefined group.
Remarks:  Note the type of the binding object dictates whether the parameter is bound to all
instances or just types. A parameter definition cannot be bound to both instances and types.
If the Parameter binding already exists, post an error and return false

Autodesk.Revit.DB.BindingMap.Insert(Autodesk.Revit.DB.Definition,Autodesk.Revit.DB.Binding)
Creates a new parameter binding.
Creates a new parameter binding between a parameter and a set of categories.
key: A parameter definition which can be an existing definition or one from a shared parameters file.
item: An InstanceBinding or TypeBinding object which contains the set of categories to which the parameter should be bound.
Remarks: Note the type of the binding object dictates whether the parameter is bound to all
instances or just types. A parameter definition cannot be bound to both instances and types.
If the parameter binding already exists, post an error and return false.

Autodesk.Revit.DB.BindingMap
The parameters BindingMap contains all the parameter bindings that exist in the
Autodesk Revit project.
Remarks: The ParameterBindingsMap is available from the Document.ParameterBindings property. A
parameter binding is the way that a parameter definition is bound to elements within one
or more categories. This map can be used to interrogate existing bindings, but it can also
be used to generate new parameter bindings by using the Insert method.